In [7]:
import pandas as pd
india_weather = pd.DataFrame({
    'City':['Mumbai','Delhi','Banglore'],
    'Humidity':[80,60,70],
    'Temperature':[32,45,30]
})
india_weather

       City  Humidity  Temperature
0    Mumbai        80           32
1     Delhi        60           45
2  Banglore        70           30

In [4]:
import pandas as pd
us_weather = pd.DataFrame({
    'City':['New York','Chicago','Orlando'],
    'Humidity':[68,75,70],
    'Temperature':[21,14,35]
})
us_weather

       City  Humidity  Temperature
0  New York        68           21
1   Chicago        75           14
2   Orlando        70           35

***Contactenation***

In [9]:
df=pd.concat([india_weather,us_weather],ignore_index=True)
df

       City  Humidity  Temperature
0    Mumbai        80           32
1     Delhi        60           45
2  Banglore        70           30
3  New York        68           21
4   Chicago        75           14
5   Orlando        70           35

***Concatenation using keys***

In [10]:
df=pd.concat([india_weather,us_weather],keys=['India','US'])
df

             City  Humidity  Temperature
India 0    Mumbai        80           32
      1     Delhi        60           45
      2  Banglore        70           30
US    0  New York        68           21
      1   Chicago        75           14
      2   Orlando        70           35

***Location(loc) Keyword**

In [11]:
df.loc['US']

       City  Humidity  Temperature
0  New York        68           21
1   Chicago        75           14
2   Orlando        70           35

***Using Indexing***

In [18]:
temperature_df = pd.DataFrame({
    'City':['Mumbai','Delhi','Banglore'],
    'Temperature':[32,45,30]
},index=[0,1,2])
temperature_df

       City  Temperature
0    Mumbai           32
1     Delhi           45
2  Banglore           30

In [15]:
windspeed_df = pd.DataFrame({
    'City':['Delhi','Mumbai'],
    'Windspeed':[7,12]
},index=[1,0])
windspeed_df

     City  Windspeed
1   Delhi          7
0  Mumbai         12

***CONTATENATION***

In [19]:
df=pd.concat([temperature_df,windspeed_df],axis=1)
df

       City  Temperature    City  Windspeed
0    Mumbai           32  Mumbai       12.0
1     Delhi           45   Delhi        7.0
2  Banglore           30     NaN        NaN

***Concatenate dataframe with series***

In [20]:
s=pd.Series(['Humid','Dry','Rain'],name='Event')
s

0    Humid
1      Dry
2     Rain
Name: Event, dtype: object

In [22]:
df=pd.concat([df,s],axis=1)
df

       City  Temperature    City  Windspeed  Event
0    Mumbai           32  Mumbai       12.0  Humid
1     Delhi           45   Delhi        7.0    Dry
2  Banglore           30     NaN        NaN   Rain